stress.yml
config:
  target: 'http://127.0.0.1:3004'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: "Warm up the application"
    - duration: 120
      arrivalRate: 2
      rampTo: 4
      name: "ramp up"
    - duration: 120
      arrivalRate: 4
      rampTo: 5
      name: "keep ramping"
    - duration: 240
      arrivalRate: 5
      name: "Sustained max load"
    - duration: 120
      arrivalRate: 5
      rampTo: 1
      name: "shhhh"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - loop:
      - get:
          url: "/photos/restaurant/{{$randomNumber(1,10000000)}}/photos"
      count: 100